tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/services"
tap "keidarcy/tap"
tap "mongodb/brew"
brew "bat"
brew "eza"
brew "fd"
brew "fzf"
brew "gawk"
brew "gh"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "kubernetes-cli"
brew "mongosh"
brew "neovim"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "wget"
brew "eth-p/software/bat-extras"
brew "keidarcy/tap/e1s"
cask "alacritty"
cask "font-jetbrains-mono-nerd-font"
cask "hammerspoon"
